app/Controllers/TransaksiController.php

    public function save(){
        // DEKLARASI MODEL
        $model_BarangModel = new BarangModel;
        $model_TransaksiModel = new TransaksiModel;
        $model_DetailTransaksiModel = new DetailTransaksiModel;

        //  GET SESSION CART
        $cart_session = session()->get('cart');

        // DEKLARASI TOTAL PEMBAYARAN
        $total_pembayaran = 0;

        // PROSES MENGHITUNG TOTAL PEMBAYARAN
        foreach ($cart_session as $cs) {
            $total_pembayaran += $cs['subtotal'];
        }

        // PROSES INSERT DATA KE TBL_TRANSAKSI
        $data_transaksi = array(
            'status_pembayaran' => 1,
            'metode_pembayaran' => $this->request->getPost('metode_pembayaran'),
            'total_pembayaran' => $total_pembayaran,
            'nama_pembeli' => $this->request->getPost('nama_pembeli'),
            'email' => $this->request->getPost('email'),
            'telepon' => $this->request->getPost('telepon'),
            'alamat' => $this->request->getPost('alamat'),
            'kode_pos' => $this->request->getPost('kode_pos')
        );

        $model_TransaksiModel->insert($data_transaksi);
---
INSERT INTO `tbl_transaksi` (`status_pembayaran`, `metode_pembayaran`, `total_pembayaran`, `nama_pembeli`, `email`, `telepon`, `alamat`, `kode_pos`) VALUES (1, 'Ovo', 12000, 'bagus', 'bagusnugroho1604@gmail.com', '3243243', 'cimias', '46215')

                'subtotal' => $css['subtotal']
            );

            $model_DetailTransaksiModel->insert($data_detail_transaksi);

            // PROSES MENGURANGI STOK
            $product = $model_BarangModel->find($css['id']);
---
INSERT INTO `tbl_detail_transaksi` (`id_transaksi`, `id_barang`, `harga_beli`, `qty`, `subtotal`) VALUES (16, '9', '10000.00', '1', 10000)
SELECT *
FROM `tbl_barang`
WHERE `tbl_barang`.`id` = '9'

                'stok_barang' => $product['stok_barang'] - $css['qty']
            ];

            $model_BarangModel->update($css['id'], $data_barang);
---
UPDATE `tbl_barang` SET `stok_barang` = 199
WHERE `tbl_barang`.`id` IN ('9')